`July 15, 2022`

### **ACCESS MYSQL USING PYTHON**

#### **Instalasi library**

In [1]:
# Jika run installer di cell .ipynb, tambahkan '!' sebelum pip
! pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\maulialwan\anaconda3\lib\site-packages (8.0.28)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\maulialwan\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.4)

In [2]:
# Install SQLAlchemy
! pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\maulialwan\anaconda3\lib\site-packages (1.4.22)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\maulialwan\anaconda3\lib\site-packages (from SQLAlchemy) (1.1.1)

In [4]:
# Install Pandas
! pip install pandas

Requirement already satisfied: pandas in c:\users\maulialwan\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: numpy>=1.17.3 in c:\users\maulialwan\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: pytz>=2017.3 in c:\users\maulialwan\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\maulialwan\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\maulialwan\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

**STEP 1**

In [3]:
# Import libraries yang dibutuhkan
import pandas as pd
import mysql.connector
import sqlalchemy as alc

**STEP 2**

In [7]:
# Buat profil koneksi untuk log in ke akun MySQL
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'password', # ganti password dengan paswword MySQL masing-masing
    database = 'employees' # ganti sesuai nama database yang diinginkan
)

# Jika mau mengganti database, ganti nama database-nya, lalu run ulang cell.

**STEP 3**

In [8]:
from sqlalchemy import create_engine

engine = create_engine('mysql+mysqlconnector://root:password@localhost/employees') # Ganti kata 'password' dengan 
                                                                                    # password MySQL masing-masing

# Jika mau mengganti database, ganti nama database-nya di setelah / terakhir, lalu run ulang cell.

### Akses data

**Metode pertama**

In [16]:
# Membuat akses database
mycursor = mydb.cursor()

# Tulis query
query = '''
        SELECT *
        FROM employees
        '''

# Eksekusi query
mycursor.execute(query)

# Simpan hasil query pada variabel bernama result
result = mycursor.fetchall()

# Konversi outcome ke dalam DataFrame
df = pd.DataFrame(result, columns=mycursor.column_names)

# Menampilkan 5 baris awal
df.head()

# Menampilkan 5 baris terakhir
df.tail()

        emp_no  birth_date first_name last_name gender   hire_date
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

**Metode kedua**

In [11]:
# Mebuat function untuk mengakses database

mycursor = mydb.cursor

def sql_df(your_query):
    mycursor.execute(your_query)
    result = mycursor.fetchall()
    df = pd.DataFrame(result, columns=mycursor.column_names)
    return df

In [21]:
# Syntax untuk menuliskan query dengan cara 
  # memanggil nama function yang sudah dibuat

sql_df('''
        SELECT * 
        FROM employees
        LIMIT 3
        '''
)

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28

**Metode ketiga**

In [19]:
# Masukkan query ke dalam variable query
query = '''
SELECT * FROM employees
LIMIT 7
'''

# Panggil data dengan menggunakan function read_sql dari Pandas
pd.read_sql(query, engine)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10